Repository: realchoi/Picser
Catalog: Languages/Localizable.xcstrings
Source language: en
Languages: zh_hans

# zoom_anchor_pointer_toggle_description
source: Keeps the cursor position locked when zooming (may reveal background).
zh_hans: 缩放时锁定当前指针位置，可能会露出背景区域。

# zoom_settings_group
source: Zoom Settings
zh_hans: 缩放设置

# zoom_shortcut_description
source: Use with mouse wheel to zoom images
zh_hans: 配合鼠标滚轮缩放图片

# zoom_shortcut_label
source: Zoom Shortcut
zh_hans: 缩放快捷键

# delete_permission_open_fallback
source: Unable to open System Settings automatically. Please open Privacy & Security > Full Disk Access manually.
zh_hans: 无法自动打开系统设置，请手动进入“系统设置 > 隐私与安全性 > 完整磁盘访问”。

# navigation_wasd
source: WASD keys
zh_hans: WASD 键

# navigation_hjkl
source: HJKL keys
zh_hans: HJKL 键

# image_navigation_label
source: Image Navigation Shortcuts
zh_hans: 图片导航快捷键

# image_navigation_description
source: Choose which keys to use for switching between images. You can select multiple key combinations.
zh_hans: 选择用于切换图片的快捷键组合。可同时选择多种按键组合。

# tag_filter_section_title
source: Filter by Tags
zh_hans: 按标签筛选

# tag_filter_mode_button
source: Mode
zh_hans: 模式

# tag_filter_selection_summary_none
source: All tags
zh_hans: 全部标签

# tag_filter_selection_summary_some
source: %d tags selected
zh_hans: 已选 %d 个标签

# tag_filter_tag_search_placeholder
source: Search tags
zh_hans: 搜索标签

# tag_filter_tag_search_empty
source: No matching tags
zh_hans: 没有匹配的标签

# tag_filter_tag_clear_button
source: Clear tags
zh_hans: 清除标签

# tag_filter_keyword_label
source: Keyword
zh_hans: 关键字

# tag_filter_keyword_placeholder
source: Match file or folder names
zh_hans: 输入关键字匹配文件或文件夹

# tag_filter_color_title
source: Colors
zh_hans: 颜色

# tag_filter_color_clear_button
source: Clear Colors
zh_hans: 清除颜色

# tag_filter_color_search_placeholder
source: Search colors
zh_hans: 搜索颜色

# tag_filter_color_search_empty
source: No matching colors
zh_hans: 没有匹配的颜色

# tag_filter_color_summary_none
source: All colors
zh_hans: 全部颜色

# tag_filter_color_summary_some
source: %d colors selected
zh_hans: 已选 %d 种颜色

# tag_filter_smart_save_button
source: Save Preset
zh_hans: 保存筛选方案

# tag_filter_smart_section_title
source: Filter Presets
zh_hans: 筛选方案

# tag_filter_smart_sheet_title
source: Name Filter Preset
zh_hans: 命名筛选方案

# tag_filter_smart_sheet_placeholder
source: e.g. Blue portraits
zh_hans: 例如：蓝色人像

# tag_filter_smart_sheet_save_button
source: Save Preset
zh_hans: 保存方案

# tag_filter_show_button
source: Filter by tags
zh_hans: 按标签筛选

# tag_filter_mode_any
source: Any Tag
zh_hans: 匹配任意标签

# tag_filter_mode_all
source: All Tags
zh_hans: 匹配全部标签

# tag_filter_mode_exclude
source: Exclude
zh_hans: 排除

# tag_filter_clear_button
source: Clear all filters
zh_hans: 清除所有筛选

# tag_filter_empty_hint
source: No tags available yet
zh_hans: 暂无标签

# tag_editor_title
source: Tags
zh_hans: 标签

# tag_editor_library_button
source: Tag Library
zh_hans: 标签库

# tag_editor_recommend_title
source: Recommended tags
zh_hans: 推荐标签

# tag_editor_no_tags
source: No tags available
zh_hans: 没有可用的标签

# tag_editor_empty
source: No tags on this image
zh_hans: 当前图片尚未添加标签

# tag_editor_placeholder
source: Add tags, press Enter to confirm
zh_hans: 输入标签，按回车确认

# tag_editor_toolbar_show
source: Show Tag Editor
zh_hans: 展开标签编辑

# tag_editor_toolbar_hide
source: Hide Tag Editor
zh_hans: 收起标签编辑

# filter_no_match_title
source: No matches for current filter
zh_hans: 当前筛选没有匹配项

# filter_no_match_message
source: Adjust or clear the tag filters to continue browsing.
zh_hans: 请调整或清除标签筛选后再试。

# tag_error_duplicate
source: A tag with the same name already exists.
zh_hans: 已存在同名标签。

# tag_error_invalid_name
source: Please enter a valid tag name.
zh_hans: 请输入有效的标签名称。

# tag_feedback_dismiss_button
source: Dismiss
zh_hans: 知道了

# tag_feedback_inspect_failure
source: Inspection failed: %@
zh_hans: 巡检失败：%@

# tag_feedback_inspect_success
source: Inspection finished: checked %d item(s), recovered %d tag(s), removed %d missing entries.
zh_hans: 巡检完成：检查 %d 项，恢复 %d 条，移除 %d 个缺失记录。

# tag_feedback_sync_failure
source: Failed to sync tags: %@
zh_hans: 同步标签失败：%@

# tag_feedback_sync_success
source: Synced tags for %d photo(s).
zh_hans: 已同步 %d 张照片的标签。

# smart_filter_error_duplicate_name
source: A filter preset with this name already exists.
zh_hans: 已存在同名筛选方案。

# smart_filter_error_duplicate_filter
source: A filter preset with identical conditions already exists.
zh_hans: 已存在条件完全相同的筛选方案。

# tag_settings_tab
source: Tags
zh_hans: 标签

# tag_settings_refresh_button
source: Refresh
zh_hans: 刷新

# tag_settings_delete_title
source: Delete Tag
zh_hans: 删除标签

# tag_settings_delete_message
source: “%@” is currently used %d time(s). Continue?
zh_hans: “%@” 当前被使用 %d 次，确定删除吗？

# tag_settings_empty
source: No tags yet. Add them from the detail view to manage here.
zh_hans: 还没有标签，去图片详情页面添加吧。

# tag_usage_format
source: Used %d time(s)
zh_hans: 已被使用 %d 次

# tag_settings_rename_button
source: Rename
zh_hans: 重命名

# tag_settings_delete_button
source: Delete
zh_hans: 删除

# tag_settings_rename_title
source: Rename Tag
zh_hans: 重命名标签

# tag_settings_rename_placeholder
source: Enter new tag name
zh_hans: 输入新的标签名称

# tag_settings_inspection_title
source: Tag Health Check
zh_hans: 标签巡检

# tag_settings_inspection_description
source: Last scan checked %d photo(s), recovered %d, and removed %d orphan entries.
zh_hans: 上次巡检共检查 %d 张图片，恢复 %d 张，清理 %d 条失效记录。

# tag_settings_inspection_button
source: Run Scan Now
zh_hans: 立即巡检

# tag_settings_inspection_running
source: Scanning...
zh_hans: 正在巡检...

# tag_settings_inspection_never
source: No inspection has been run yet.
zh_hans: 尚未执行过巡检。

# tag_settings_inspection_missing_title
source: Missing files (%d)
zh_hans: 未找到的图片（%d）

# tag_settings_inspection_missing_more
source: And %d more...
zh_hans: 另有 %d 条...

# tag_settings_color_picker_label
source: Tag Color
zh_hans: 标签颜色

# tag_settings_color_clear_button
source: Reset Color
zh_hans: 重置颜色

# tag_settings_batch_mode_toggle
source: Batch Manage Tags
zh_hans: 批量管理标签

# tag_settings_batch_selection_count
source: %d selected
zh_hans: 已选择 %d 个

# tag_settings_batch_color_picker
source: Batch Color
zh_hans: 批量颜色

# tag_settings_batch_apply_color
source: Apply Color
zh_hans: 应用颜色

# tag_settings_batch_clear_color
source: Clear Color
zh_hans: 清除颜色

# tag_settings_batch_delete_button
source: Delete Tags
zh_hans: 删除标签

# tag_settings_batch_delete_dialog_title
source: Delete selected tags?
zh_hans: 确定删除所选标签？

# tag_editor_batch_menu_label
source: Batch targets (%d)
zh_hans: 批量目标（%d）

# tag_editor_batch_hint
source: Tags will apply to %d image(s)
zh_hans: 标签将应用到 %d 张图片

# tag_editor_batch_only_current
source: Only current image
zh_hans: 仅当前图片

# tag_editor_batch_select_all
source: Select all images
zh_hans: 选择全部图片

# tag_editor_chip_color
source: Set Color
zh_hans: 设置颜色

# tag_editor_color_sheet_title
source: Choose color for “%@”
zh_hans: 为“%@”选择颜色

# tag_editor_color_sheet_clear
source: Clear Color
zh_hans: 清除颜色

# tag_editor_color_sheet_save
source: Save
zh_hans: 保存

# tag_settings_batch_add_button
source: Add Tags
zh_hans: 批量添加

# tag_settings_batch_add_title
source: Add Multiple Tags
zh_hans: 批量新增标签

# tag_settings_batch_add_hint
source: Enter tag names separated by commas or line breaks.
zh_hans: 输入多个标签名称，可用英文逗号或换行分隔。

# tag_settings_clear_assignments_title
source: Clear assignments for selected tags?
zh_hans: 清除所选标签下的全部图片？

# tag_settings_clear_assignments_button
source: Clear Assignments
zh_hans: 清空图片

# tag_settings_merge_button
source: Merge Tags
zh_hans: 合并标签

# tag_settings_merge_title
source: Merge %d tags
zh_hans: 合并 %d 个标签

# tag_settings_merge_hint
source: All selected tags will be merged into the target name.
zh_hans: 所有选中标签都会合并到目标名称。

# tag_settings_merge_placeholder
source: Target tag name
zh_hans: 输入目标标签名称

# tag_settings_cleanup_button
source: Clean Up
zh_hans: 清理未使用

# tag_settings_cleanup_confirm_title
source: Remove tags without any images?
zh_hans: 确定删除所有未使用标签？

# tag_settings_stats_title
source: Tag Stats
zh_hans: 标签统计

# tag_settings_stats_total
source: Total
zh_hans: 总数

# tag_settings_stats_used
source: In Use
zh_hans: 已使用

# tag_settings_stats_unused
source: Unused
zh_hans: 未使用

# tag_settings_feedback_history_button
source: View History
zh_hans: 查看历史

# tag_settings_feedback_history_title
source: Activity Log
zh_hans: 操作历史

# tag_settings_feedback_history_close
source: Close
zh_hans: 关闭

# tag_settings_smart_filters_title
source: Filter Presets
zh_hans: 筛选方案

# tag_settings_smart_filters_empty
source: No presets yet. Save a filter to reuse it here.
zh_hans: 还没有筛选方案，可在筛选时保存条件以便复用。

# tag_settings_smart_filters_apply
source: Apply
zh_hans: 应用

# tag_settings_smart_filters_rename
source: Rename
zh_hans: 重命名

# tag_settings_smart_filters_delete
source: Delete
zh_hans: 删除

# tag_settings_smart_filters_summary_mode
source: Mode: %@
zh_hans: 模式：%@

# tag_settings_smart_filters_summary_tags
source: Tags: %@
zh_hans: 标签：%@

# tag_settings_smart_filters_summary_tags_fallback
source: %d tags
zh_hans: %d 个标签

# tag_settings_smart_filters_summary_keyword
source: Keyword: %@
zh_hans: 关键字：%@

# tag_settings_smart_filters_summary_colors
source: Colors: %@
zh_hans: 颜色：%@

# tag_settings_smart_sheet_title
source: Rename Filter Preset
zh_hans: 重命名筛选方案

# tag_settings_smart_sheet_save_button
source: Save
zh_hans: 保存

# tag_settings_smart_delete_title
source: Delete Filter Preset?
zh_hans: 删除筛选方案？

# tag_settings_smart_delete_message
source: Delete "%@"? This cannot be undone.
zh_hans: 确定删除“%@”？该操作不可撤销。

# tag_settings_smart_delete_confirm
source: Delete
zh_hans: 删除

# tag_settings_search_placeholder
source: Search tags
zh_hans: 搜索标签

# tag_settings_search_empty
source: No tags match the current search.
zh_hans: 没有符合搜索条件的标签

# tag_settings_tools_section_title
source: Tag tools & list
zh_hans: 标签工具与列表

# tag_settings_tools_section_subtitle
source: Manage batches, search, and browse tags here.
zh_hans: 批量处理、搜索与标签列表集中在此。

# tag_settings_batch_toggle_short
source: Batch mode
zh_hans: 批量模式

# tag_settings_batch_disabled_summary
source: Batch tools disabled
zh_hans: 批量工具未启用

# tag_settings_empty_hint
source: Use the batch tools above to add or import tags quickly.
zh_hans: 可通过上方批量工具快速新增标签，或导入现有标签集合。

# tag_settings_search_hint
source: Try adjusting keywords or smart filters to find the right tags.
zh_hans: 尝试调整搜索关键字或切换筛选方案，以找到目标标签。

# tag_settings_smart_summary_active
source: Active: %@
zh_hans: 当前：%@

# tag_settings_smart_summary_count
source: %d smart presets
zh_hans: 共 %d 个方案

# database_error_unknown
source: Unknown error
zh_hans: 未知错误

# database_error_uninitialized
source: Database not initialized
zh_hans: 数据库尚未初始化

# database_error_open_failed
source: Failed to open database (%d): %@
zh_hans: 打开数据库失败 (%d)：%@

# database_error_execution_failed
source: SQL execution failed (%d): %@ SQL: %@
zh_hans: 执行 SQL 失败 (%d)：%@ SQL: %@

# database_error_prepare_failed
source: Failed to prepare SQL statement: %@
zh_hans: 预编译 SQL 失败：%@
